finances/20250518-cdi-or-real-state.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CDI or Real State</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/theme/style.css" />
</head>
<body>
<div id="preamble" class="status">
<header>
  <h1><a href="/">thisago's blog</a></h1>
</header>
</div>
<div id="content" class="content">
<h1 class="title">CDI or Real State</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org489f360">The data</a>
<ul>
<li><a href="#orgdce5b4b">Applied value</a></li>
<li><a href="#org5dd2452">Liquid total after earnings</a></li>
<li><a href="#org1336a3d">Days from the application day until today</a></li>
</ul>
</li>
<li><a href="#org3af8c9c">Calculations</a>
<ul>
<li><a href="#org271318e">Earned percentage on above values</a>
<ul>
<li><a href="#org578a770">Checking the percentage</a></li>
</ul>
</li>
<li><a href="#org424a928">Dividing the percentage per day</a></li>
<li><a href="#org9dda9a2">Rule of three on the earnings</a>
<ul>
<li><a href="#org1e089f2">Daily</a></li>
<li><a href="#orgd2f11de">Monthly</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org147e2a9">Conclusion</a></li>
</ul>
</div>
</div>
<blockquote>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><code></code></td>
</tr>
</tbody>
</table>

<p>
This post relies heavily on current Brazil's low-risk investment revenue rates.
</p>

<p>
For the non-brazilians, it serves only as a template.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>
</blockquote>

<p>
After ignoring the investment world in name of comfort, recently I moved my cash into a low-risk investment, based on Brazilian CDI (<i>Certificado de Depósito Interbancário</i>), a benchmark interest rate used in Brazil's financial markets commonly for fixed-income investments that changes daily.
</p>

<p>
The banking says things like "(110%|115%) of CDI but it may change", so I don't even know the exact "percentage on top of the CDI" that was really applied. There's also a lot of taxes, so I'll ignore all this percentages and over-complicated values and consider only the liquid values: How much I applied and how much it became.
</p>

<p>
I was skeptic about it's feasibility because <i>there's no free lunch</i> but I was also worried about high inflation levels here in Brazil and wanted to prevent it in somehow.
</p>

<p>
Below are my results.
</p>

<div id="outline-container-org489f360" class="outline-2">
<h2 id="org489f360">The data</h2>
<div class="outline-text-2" id="text-org489f360">
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">󰌵 Used currency is BRL.</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orgdce5b4b" class="outline-3">
<h3 id="orgdce5b4b">Applied value</h3>
<div class="outline-text-3" id="text-orgdce5b4b">
<pre class="example" id="org52084a6">
5000
</pre>
</div>
</div>
<div id="outline-container-org5dd2452" class="outline-3">
<h3 id="org5dd2452">Liquid total after earnings</h3>
<div class="outline-text-3" id="text-org5dd2452">
<pre class="example" id="org2c72b55">
5058.28
</pre>
</div>
</div>
<div id="outline-container-org1336a3d" class="outline-3">
<h3 id="org1336a3d">Days from the application day until today</h3>
<div class="outline-text-3" id="text-org1336a3d">
<p>
The days range: <span class="timestamp-wrapper"><span class="timestamp">[2025-04-10 Thu]&#x2013;[2025-05-18 Sun]</span></span>
</p>

<p>
Becomes:
</p>
<pre class="example" id="org1ecfcf2">
39
</pre>
</div>
</div>
</div>

<div id="outline-container-org3af8c9c" class="outline-2">
<h2 id="org3af8c9c">Calculations</h2>
<div class="outline-text-2" id="text-org3af8c9c">
</div>
<div id="outline-container-org271318e" class="outline-3">
<h3 id="org271318e">Earned percentage on above values</h3>
<div class="outline-text-3" id="text-org271318e">
<div class="org-src-container">
<pre class="src src-calc" id="orgbe1d83f">resultingBalance / applied - 1
</pre>
</div>

<pre class="example">
0.011656
</pre>
</div>

<div id="outline-container-org578a770" class="outline-4">
<h4 id="org578a770">Checking the percentage</h4>
<div class="outline-text-4" id="text-org578a770">
<p>
Just to make sure the percentage is right.
</p>
<div class="org-src-container">
<pre class="src src-calc">applied * percentage
</pre>
</div>

<pre class="example">
58.28
</pre>
</div>
</div>
</div>

<div id="outline-container-org424a928" class="outline-3">
<h3 id="org424a928">Dividing the percentage per day</h3>
<div class="outline-text-3" id="text-org424a928">
<p>
Since our math are based on a <code>39</code> days investment, let's get the average percentage earned per day.
</p>
<div class="org-src-container">
<pre class="src src-calc" id="orgeda70e1">percentage / days
</pre>
</div>

<pre class="example">
2.98871794872e-4
</pre>
</div>
</div>

<div id="outline-container-org9dda9a2" class="outline-3">
<h3 id="org9dda9a2">Rule of three on the earnings</h3>
<div class="outline-text-3" id="text-org9dda9a2">
<p>
Let's calculate how much it will revenue on some arbitrary values.
</p>
</div>
<div id="outline-container-org1e089f2" class="outline-4">
<h4 id="org1e089f2">Daily</h4>
<div class="outline-text-4" id="text-org1e089f2">
</div>
<ul class="org-ul">
<li><a id="orgcc70cac"></a>On 1k<br>
<div class="outline-text-5" id="text-orgcc70cac">
<div class="org-src-container">
<pre class="src src-calc">1000 * dailyPercentage
</pre>
</div>

<pre class="example">
0.298871794872
</pre>
</div>
</li>

<li><a id="org7e58401"></a>On 100k<br>
<div class="outline-text-5" id="text-org7e58401">
<div class="org-src-container">
<pre class="src src-calc">100000 * dailyPercentage
</pre>
</div>

<pre class="example">
29.8871794872
</pre>
</div>
</li>

<li><a id="org7a28689"></a>On 300k<br>
<div class="outline-text-5" id="text-org7a28689">
<div class="org-src-container">
<pre class="src src-calc">300000 * dailyPercentage
</pre>
</div>

<pre class="example">
89.6615384616
</pre>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgd2f11de" class="outline-4">
<h4 id="orgd2f11de">Monthly</h4>
<div class="outline-text-4" id="text-orgd2f11de">
<p>
First let's multiply the daily percentage by 30:
</p>
<div class="org-src-container">
<pre class="src src-calc" id="org7d1f670">dailyPercentage * 30
</pre>
</div>

<pre class="example">
8.96615384616e-3
</pre>
</div>

<ul class="org-ul">
<li><a id="orgfdabef8"></a>On 1k<br>
<div class="outline-text-5" id="text-orgfdabef8">
<div class="org-src-container">
<pre class="src src-calc">1000 * monthlyPercentage
</pre>
</div>

<pre class="example">
8.96615384616
</pre>
</div>
</li>

<li><a id="orgadf252e"></a>On 100k<br>
<div class="outline-text-5" id="text-orgadf252e">
<div class="org-src-container">
<pre class="src src-calc">100000 * monthlyPercentage
</pre>
</div>

<pre class="example">
896.615384616
</pre>
</div>
</li>

<li><a id="org87c423e"></a>On 300k<br>
<div class="outline-text-5" id="text-org87c423e">
<div class="org-src-container">
<pre class="src src-calc">300000 * monthlyPercentage
</pre>
</div>

<pre class="example">
2689.84615385
</pre>
</div>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org147e2a9" class="outline-2">
<h2 id="org147e2a9">Conclusion</h2>
<div class="outline-text-2" id="text-org147e2a9">
<p>
The last projection that calculates the revenue of a 300k investment in 30 days shows that for now, it seems better to keep money invested on this fund instead of investing on a 300k house, considering its rent will be in a range of 1500 to 3000 BRL.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">You can copy this Org File and evaluate with different values.</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
See the source code <a href="https://github.com/thisago/blog">here</a>.
</div>
</body>
</html>
